GridDependency/FarField50Chord/gd_250x100_Re6E6_AoA3/0/nuTilda
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}

dimensions      [0 2 -1 0 0 0 0];

internalField  uniform  1.0e-05;

boundaryField
{
    freestream
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            fixedValue;
        value           uniform 0;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}