GridDependency/FarField50Chord/gd_250x100_Re6E6_AoA3/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    upperSurface
    {
        type            calculated;
        value           nonuniform List<vector> 
150
(
(-6.8748468 2.5841651e-22 -0.47643986)
(-6.9229199 1.5656113e-22 -0.47073748)
(-6.969885 -2.9977237e-21 -0.46463271)
(-7.01574 -6.063501e-22 -0.45821876)
(-7.0604869 2.9080103e-21 -0.45148843)
(-7.1040938 1.7976057e-21 -0.44437304)
(-7.1465628 -2.4947932e-21 -0.43691252)
(-7.1879104 4.4337476e-22 -0.42912912)
...
)
;
    }
    lowerSurface
    {
        type            calculated;
        value           nonuniform List<vector> 
150
(
(-6.8752627 2.7607438e-22 -0.4843754)
(-6.9242882 1.9444798e-22 -0.49684636)
(-6.972239 -4.3535832e-21 -0.50954854)
(-7.0191029 -1.0363982e-21 -0.52238684)
(-7.0648828 5.905038e-21 -0.53536778)
(-7.1095537 4.3993848e-21 -0.54855425)
(-7.1531134 -7.5008055e-21 -0.56190534)
(-7.1955761 1.6823736e-21 -0.57539996)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
