GridDependency/FarField50Chord/gd_250x100_Re6E6_AoA3/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    upperSurface
    {
        type            calculated;
        value           nonuniform List<scalar> 
150
(
93.594889
93.501746
93.412664
93.327497
93.246088
93.168351
93.094145
93.023312
...
)
;
    }
    lowerSurface
    {
        type            calculated;
        value           nonuniform List<scalar> 
150
(
93.594889
93.501746
93.412664
93.327497
93.246088
93.168351
93.094145
93.023312
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
