GridDependency/FarField50Chord/gd_250x100_Re6E6_AoA3/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}

// perfect air
thermoType
{
    type hePsiThermo;
    mixture pureMixture;
    transport const;
    thermo hConst;
    equationOfState perfectGas;
    specie specie;
    energy sensibleInternalEnergy;
}

mixture // air at room temp (293K, 20C). AIR IS ACTUALLY 220K, but differences are marginal.
{
    specie
    {
        molWeight 28.9;
    }
    thermodynamics
    {
        Cp 1005;
        Hf 0;
    }
    transport
    {
        mu 1.82e-05;
        Pr 0.71;
    }
}