GridDependency/FarField50Chord/gd_250x100_Re6E6_AoA3/system/decomposeParDict
FoamFile
{
	version 2.0;
	format ascii;
	class dictionary;
	object decomposeParDict;
}

numberOfSubdomains 8;

method scotch;
