GridDependency/FarField50Chord/gd_250x100_Re6E6_AoA3/system/fvOptions
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}

limitT
{
    type limitTemperature;
    min 101;
    max 500;
    selectionMode all;
}