GridDependency/FarField50Chord/gd_250x100_Re6E6_AoA3/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

// This file will change when I do the study.

ddtSchemes
{
    default localEuler;
}

gradSchemes
{
    default Gauss linear;

    limited cellLimited Gauss linear 1;
    grad(U) $limited;
    grad(k) $limited;
    grad(omega) $limited;
}

divSchemes
{
    default none;

    div(phi,U) Gauss linearUpwind limited;

    turbulence Gauss linearUpwind limited;
    energy Gauss linearUpwind limited;

    div(phi,k) $turbulence;
    div(phi,omega) $turbulence;
    div(phi,nuTilda) $turbulence;

    div(phi,e) $energy;
    div(phi,K) $energy;
    div(phi,Ekp) $energy;

    div(phid,p) Gauss limitedLinear 1;
    div(phiv,p) Gauss upwind;
    div((phi|interpolate(rho)),p) Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default Gauss linear corrected;
}

interpolationSchemes
{
    default linear;
}

snGradSchemes
{
    default corrected;
}

wallDist
{
    method meshWave;
}