GridDependency/FarField50Chord/gd_250x100_Re6E6_AoA3/system/residuals
#includeEtc "caseDicts/postProcessing/numerical/residuals.cfg"

fields (p U e k omega);