GridDependency/FarField50Chord/gd_250x100_Re6E6_AoA3/system/sampleLowerPwall
type            surfaceFieldValue;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime;
writeFields     true;

surfaceFormat   raw;
regionType      patch;
name            lowerSurface;

operation       none;

fields
(
    p
    yPlus
    wallShearStress
);